Tintech-Ireland/ESP32C3-USA/0.0.6/tools/sdk/include/soc/soc/mcpwm_struct.h
    union {
        struct {
            uint32_t f0_en:      1;                    /*When set  event_f0 generation is enabled*/
            uint32_t f1_en:      1;                    /*When set  event_f1 generation is enabled*/
            uint32_t f2_en:      1;                    /*When set  event_f2 generation is enabled*/
            uint32_t f0_pole:    1;                    /*Set event_f0 trigger polarity on FAULT2 source from GPIO matrix. 0: level low  1: level high*/
            uint32_t f1_pole:    1;                    /*Set event_f1 trigger polarity on FAULT2 source from GPIO matrix. 0: level low  1: level high*/
            uint32_t f2_pole:    1;                    /*Set event_f2 trigger polarity on FAULT2 source from GPIO matrix. 0: level low  1: level high*/
            uint32_t event_f0:   1;                    /*Set and reset by hardware. If set  event_f0 is on going*/
            uint32_t event_f1:   1;                    /*Set and reset by hardware. If set  event_f1 is on going*/
            uint32_t event_f2:   1;                    /*Set and reset by hardware. If set  event_f2 is on going*/
            uint32_t reserved9: 23;
        };
        uint32_t val;
    }fault_detect;
    union {
        struct {
            uint32_t timer_en:  1;                 /*When set  capture timer incrementing under APB_clk is enabled.*/
            uint32_t synci_en:  1;                 /*When set  capture timer sync is enabled.*/
            uint32_t synci_sel: 3;                 /*capture module sync input selection. 0: none  1: timer0 synco  2: timer1 synco  3: timer2 synco  4: SYNC0 from GPIO matrix  5: SYNC1 from GPIO matrix  6: SYNC2 from GPIO matrix*/
            uint32_t sync_sw:   1;                 /*Write 1 will force a capture timer sync  capture timer is loaded with value in phase register.*/
            uint32_t reserved6:    26;
        };
        uint32_t val;
    }cap_timer_cfg;
    uint32_t cap_timer_phase;                      /*Phase value for capture timer sync operation.*/
    union {
        struct {
            uint32_t en:        1;                /*When set  capture on channel 0 is enabled*/
            uint32_t mode:      2;                /*Edge of capture on channel 0 after prescale.  bit0: negedge cap en  bit1: posedge cap en*/
            uint32_t prescale:  8;                /*Value of prescale on possitive edge of CAP0. Prescale value = PWM_CAP0_PRESCALE + 1*/
            uint32_t in_invert: 1;                /*when set  CAP0 form GPIO matrix is inverted before prescale*/
            uint32_t sw:        1;                /*Write 1 will trigger a software forced capture on channel 0*/
            uint32_t reserved13:    19;
        };
        uint32_t val;
    }cap_cfg_ch[3];
    uint32_t cap_val_ch[3];                              /*Value of last capture on channel 0*/
    union {
        struct {
            uint32_t cap0_edge:  1;                    /*Edge of last capture trigger on channel 0  0: posedge  1: negedge*/
            uint32_t cap1_edge:  1;                    /*Edge of last capture trigger on channel 1  0: posedge  1: negedge*/
            uint32_t cap2_edge:  1;                    /*Edge of last capture trigger on channel 2  0: posedge  1: negedge*/
            uint32_t reserved3: 29;
        };
        uint32_t val;
    }cap_status;
    union {
        struct {
            uint32_t global_up_en:    1;               /*The global enable of update of all active registers in MCPWM module*/
            uint32_t global_force_up: 1;               /*a toggle (software invert its value) will trigger a forced update of all active registers in MCPWM module*/
            uint32_t op0_up_en:       1;               /*When set and PWM_GLOBAL_UP_EN is set  update of active registers in PWM operator 0 are enabled*/
            uint32_t op0_force_up:    1;               /*a toggle (software invert its value) will trigger a forced update of active registers in PWM operator 0*/
            uint32_t op1_up_en:       1;               /*When set and PWM_GLOBAL_UP_EN is set  update of active registers in PWM operator 1 are enabled*/
            uint32_t op1_force_up:    1;               /*a toggle (software invert its value) will trigger a forced update of active registers in PWM operator 1*/
            uint32_t op2_up_en:       1;               /*When set and PWM_GLOBAL_UP_EN is set  update of active registers in PWM operator 2 are enabled*/
            uint32_t op2_force_up:    1;               /*a toggle (software invert its value) will trigger a forced update of active registers in PWM operator 2*/
            uint32_t reserved8:      24;
        };
        uint32_t val;
    }update_cfg;
    union {
        struct {
            uint32_t timer0_stop_int_ena: 1;           /*Interrupt when timer 0 stops*/
            uint32_t timer1_stop_int_ena: 1;           /*Interrupt when timer 1 stops*/
            uint32_t timer2_stop_int_ena: 1;           /*Interrupt when timer 2 stops*/
            uint32_t timer0_tez_int_ena:  1;           /*A PWM timer 0 TEZ event will trigger this interrupt*/
            uint32_t timer1_tez_int_ena:  1;           /*A PWM timer 1 TEZ event will trigger this interrupt*/
            uint32_t timer2_tez_int_ena:  1;           /*A PWM timer 2 TEZ event will trigger this interrupt*/
            uint32_t timer0_tep_int_ena:  1;           /*A PWM timer 0 TEP event will trigger this interrupt*/
            uint32_t timer1_tep_int_ena:  1;           /*A PWM timer 1 TEP event will trigger this interrupt*/
            uint32_t timer2_tep_int_ena:  1;           /*A PWM timer 2 TEP event will trigger this interrupt*/
            uint32_t fault0_int_ena:      1;           /*Interrupt when event_f0 starts*/
            uint32_t fault1_int_ena:      1;           /*Interrupt when event_f1 starts*/
            uint32_t fault2_int_ena:      1;           /*Interrupt when event_f2 starts*/
            uint32_t fault0_clr_int_ena:  1;           /*Interrupt when event_f0 ends*/
            uint32_t fault1_clr_int_ena:  1;           /*Interrupt when event_f1 ends*/
            uint32_t fault2_clr_int_ena:  1;           /*Interrupt when event_f2 ends*/
            uint32_t cmpr0_tea_int_ena:   1;           /*A PWM operator 0 TEA event will trigger this interrupt*/
            uint32_t cmpr1_tea_int_ena:   1;           /*A PWM operator 1 TEA event will trigger this interrupt*/
            uint32_t cmpr2_tea_int_ena:   1;           /*A PWM operator 2 TEA event will trigger this interrupt*/
            uint32_t cmpr0_teb_int_ena:   1;           /*A PWM operator 0 TEB event will trigger this interrupt*/
            uint32_t cmpr1_teb_int_ena:   1;           /*A PWM operator 1 TEB event will trigger this interrupt*/
            uint32_t cmpr2_teb_int_ena:   1;           /*A PWM operator 2 TEB event will trigger this interrupt*/
            uint32_t tz0_cbc_int_ena:     1;           /*An cycle-by-cycle trip event on PWM0 will trigger this interrupt*/
            uint32_t tz1_cbc_int_ena:     1;           /*An cycle-by-cycle trip event on PWM1 will trigger this interrupt*/
            uint32_t tz2_cbc_int_ena:     1;           /*An cycle-by-cycle trip event on PWM2 will trigger this interrupt*/
            uint32_t tz0_ost_int_ena:     1;           /*An one-shot trip event on PWM0 will trigger this interrupt*/
            uint32_t tz1_ost_int_ena:     1;           /*An one-shot trip event on PWM1 will trigger this interrupt*/
            uint32_t tz2_ost_int_ena:     1;           /*An one-shot trip event on PWM2 will trigger this interrupt*/
            uint32_t cap0_int_ena:        1;           /*A capture on channel 0 will trigger this interrupt*/
            uint32_t cap1_int_ena:        1;           /*A capture on channel 1 will trigger this interrupt*/
            uint32_t cap2_int_ena:        1;           /*A capture on channel 2 will trigger this interrupt*/
            uint32_t reserved30:          2;
        };
        uint32_t val;
    }int_ena;
    union {
        struct {
            uint32_t timer0_stop_int_raw: 1;           /*Interrupt when timer 0 stops*/
            uint32_t timer1_stop_int_raw: 1;           /*Interrupt when timer 1 stops*/
            uint32_t timer2_stop_int_raw: 1;           /*Interrupt when timer 2 stops*/
            uint32_t timer0_tez_int_raw:  1;           /*A PWM timer 0 TEZ event will trigger this interrupt*/
            uint32_t timer1_tez_int_raw:  1;           /*A PWM timer 1 TEZ event will trigger this interrupt*/
            uint32_t timer2_tez_int_raw:  1;           /*A PWM timer 2 TEZ event will trigger this interrupt*/
            uint32_t timer0_tep_int_raw:  1;           /*A PWM timer 0 TEP event will trigger this interrupt*/
            uint32_t timer1_tep_int_raw:  1;           /*A PWM timer 1 TEP event will trigger this interrupt*/
            uint32_t timer2_tep_int_raw:  1;           /*A PWM timer 2 TEP event will trigger this interrupt*/
            uint32_t fault0_int_raw:      1;           /*Interrupt when event_f0 starts*/
            uint32_t fault1_int_raw:      1;           /*Interrupt when event_f1 starts*/
            uint32_t fault2_int_raw:      1;           /*Interrupt when event_f2 starts*/
            uint32_t fault0_clr_int_raw:  1;           /*Interrupt when event_f0 ends*/
            uint32_t fault1_clr_int_raw:  1;           /*Interrupt when event_f1 ends*/
            uint32_t fault2_clr_int_raw:  1;           /*Interrupt when event_f2 ends*/
            uint32_t cmpr0_tea_int_raw:   1;           /*A PWM operator 0 TEA event will trigger this interrupt*/
            uint32_t cmpr1_tea_int_raw:   1;           /*A PWM operator 1 TEA event will trigger this interrupt*/
            uint32_t cmpr2_tea_int_raw:   1;           /*A PWM operator 2 TEA event will trigger this interrupt*/
            uint32_t cmpr0_teb_int_raw:   1;           /*A PWM operator 0 TEB event will trigger this interrupt*/
            uint32_t cmpr1_teb_int_raw:   1;           /*A PWM operator 1 TEB event will trigger this interrupt*/
            uint32_t cmpr2_teb_int_raw:   1;           /*A PWM operator 2 TEB event will trigger this interrupt*/
            uint32_t tz0_cbc_int_raw:     1;           /*An cycle-by-cycle trip event on PWM0 will trigger this interrupt*/
            uint32_t tz1_cbc_int_raw:     1;           /*An cycle-by-cycle trip event on PWM1 will trigger this interrupt*/
            uint32_t tz2_cbc_int_raw:     1;           /*An cycle-by-cycle trip event on PWM2 will trigger this interrupt*/
            uint32_t tz0_ost_int_raw:     1;           /*An one-shot trip event on PWM0 will trigger this interrupt*/
            uint32_t tz1_ost_int_raw:     1;           /*An one-shot trip event on PWM1 will trigger this interrupt*/
            uint32_t tz2_ost_int_raw:     1;           /*An one-shot trip event on PWM2 will trigger this interrupt*/
            uint32_t cap0_int_raw:        1;           /*A capture on channel 0 will trigger this interrupt*/
            uint32_t cap1_int_raw:        1;           /*A capture on channel 1 will trigger this interrupt*/
            uint32_t cap2_int_raw:        1;           /*A capture on channel 2 will trigger this interrupt*/
            uint32_t reserved30:          2;
        };
        uint32_t val;
    }int_raw;
    union {
        struct {
            uint32_t timer0_stop_int_st: 1;            /*Interrupt when timer 0 stops*/
            uint32_t timer1_stop_int_st: 1;            /*Interrupt when timer 1 stops*/
            uint32_t timer2_stop_int_st: 1;            /*Interrupt when timer 2 stops*/
            uint32_t timer0_tez_int_st:  1;            /*A PWM timer 0 TEZ event will trigger this interrupt*/
            uint32_t timer1_tez_int_st:  1;            /*A PWM timer 1 TEZ event will trigger this interrupt*/
            uint32_t timer2_tez_int_st:  1;            /*A PWM timer 2 TEZ event will trigger this interrupt*/
            uint32_t timer0_tep_int_st:  1;            /*A PWM timer 0 TEP event will trigger this interrupt*/
            uint32_t timer1_tep_int_st:  1;            /*A PWM timer 1 TEP event will trigger this interrupt*/
            uint32_t timer2_tep_int_st:  1;            /*A PWM timer 2 TEP event will trigger this interrupt*/
            uint32_t fault0_int_st:      1;            /*Interrupt when event_f0 starts*/
            uint32_t fault1_int_st:      1;            /*Interrupt when event_f1 starts*/
            uint32_t fault2_int_st:      1;            /*Interrupt when event_f2 starts*/
            uint32_t fault0_clr_int_st:  1;            /*Interrupt when event_f0 ends*/
            uint32_t fault1_clr_int_st:  1;            /*Interrupt when event_f1 ends*/
            uint32_t fault2_clr_int_st:  1;            /*Interrupt when event_f2 ends*/
            uint32_t cmpr0_tea_int_st:   1;            /*A PWM operator 0 TEA event will trigger this interrupt*/
            uint32_t cmpr1_tea_int_st:   1;            /*A PWM operator 1 TEA event will trigger this interrupt*/
            uint32_t cmpr2_tea_int_st:   1;            /*A PWM operator 2 TEA event will trigger this interrupt*/
            uint32_t cmpr0_teb_int_st:   1;            /*A PWM operator 0 TEB event will trigger this interrupt*/
            uint32_t cmpr1_teb_int_st:   1;            /*A PWM operator 1 TEB event will trigger this interrupt*/
            uint32_t cmpr2_teb_int_st:   1;            /*A PWM operator 2 TEB event will trigger this interrupt*/
            uint32_t tz0_cbc_int_st:     1;            /*An cycle-by-cycle trip event on PWM0 will trigger this interrupt*/
            uint32_t tz1_cbc_int_st:     1;            /*An cycle-by-cycle trip event on PWM1 will trigger this interrupt*/
            uint32_t tz2_cbc_int_st:     1;            /*An cycle-by-cycle trip event on PWM2 will trigger this interrupt*/
            uint32_t tz0_ost_int_st:     1;            /*An one-shot trip event on PWM0 will trigger this interrupt*/
            uint32_t tz1_ost_int_st:     1;            /*An one-shot trip event on PWM1 will trigger this interrupt*/
            uint32_t tz2_ost_int_st:     1;            /*An one-shot trip event on PWM2 will trigger this interrupt*/
            uint32_t cap0_int_st:        1;            /*A capture on channel 0 will trigger this interrupt*/
            uint32_t cap1_int_st:        1;            /*A capture on channel 1 will trigger this interrupt*/
            uint32_t cap2_int_st:        1;            /*A capture on channel 2 will trigger this interrupt*/
            uint32_t reserved30:         2;
        };
        uint32_t val;
    }int_st;
    union {
        struct {
            uint32_t timer0_stop_int_clr: 1;           /*Interrupt when timer 0 stops*/
            uint32_t timer1_stop_int_clr: 1;           /*Interrupt when timer 1 stops*/
            uint32_t timer2_stop_int_clr: 1;           /*Interrupt when timer 2 stops*/
            uint32_t timer0_tez_int_clr:  1;           /*A PWM timer 0 TEZ event will trigger this interrupt*/
            uint32_t timer1_tez_int_clr:  1;           /*A PWM timer 1 TEZ event will trigger this interrupt*/
            uint32_t timer2_tez_int_clr:  1;           /*A PWM timer 2 TEZ event will trigger this interrupt*/
            uint32_t timer0_tep_int_clr:  1;           /*A PWM timer 0 TEP event will trigger this interrupt*/
            uint32_t timer1_tep_int_clr:  1;           /*A PWM timer 1 TEP event will trigger this interrupt*/
            uint32_t timer2_tep_int_clr:  1;           /*A PWM timer 2 TEP event will trigger this interrupt*/
            uint32_t fault0_int_clr:      1;           /*Interrupt when event_f0 starts*/
            uint32_t fault1_int_clr:      1;           /*Interrupt when event_f1 starts*/
            uint32_t fault2_int_clr:      1;           /*Interrupt when event_f2 starts*/
            uint32_t fault0_clr_int_clr:  1;           /*Interrupt when event_f0 ends*/
            uint32_t fault1_clr_int_clr:  1;           /*Interrupt when event_f1 ends*/
            uint32_t fault2_clr_int_clr:  1;           /*Interrupt when event_f2 ends*/
            uint32_t cmpr0_tea_int_clr:   1;           /*A PWM operator 0 TEA event will trigger this interrupt*/
            uint32_t cmpr1_tea_int_clr:   1;           /*A PWM operator 1 TEA event will trigger this interrupt*/
            uint32_t cmpr2_tea_int_clr:   1;           /*A PWM operator 2 TEA event will trigger this interrupt*/
            uint32_t cmpr0_teb_int_clr:   1;           /*A PWM operator 0 TEB event will trigger this interrupt*/
            uint32_t cmpr1_teb_int_clr:   1;           /*A PWM operator 1 TEB event will trigger this interrupt*/
            uint32_t cmpr2_teb_int_clr:   1;           /*A PWM operator 2 TEB event will trigger this interrupt*/
            uint32_t tz0_cbc_int_clr:     1;           /*An cycle-by-cycle trip event on PWM0 will trigger this interrupt*/
            uint32_t tz1_cbc_int_clr:     1;           /*An cycle-by-cycle trip event on PWM1 will trigger this interrupt*/
            uint32_t tz2_cbc_int_clr:     1;           /*An cycle-by-cycle trip event on PWM2 will trigger this interrupt*/
            uint32_t tz0_ost_int_clr:     1;           /*An one-shot trip event on PWM0 will trigger this interrupt*/
            uint32_t tz1_ost_int_clr:     1;           /*An one-shot trip event on PWM1 will trigger this interrupt*/
            uint32_t tz2_ost_int_clr:     1;           /*An one-shot trip event on PWM2 will trigger this interrupt*/
            uint32_t cap0_int_clr:        1;           /*A capture on channel 0 will trigger this interrupt*/
            uint32_t cap1_int_clr:        1;           /*A capture on channel 1 will trigger this interrupt*/
            uint32_t cap2_int_clr:        1;           /*A capture on channel 2 will trigger this interrupt*/
            uint32_t reserved30:          2;
        };
        uint32_t val;
    }int_clr;
    union {
        struct {
            uint32_t clk_en:     1;                    /*Force clock on for this reg file*/
            uint32_t reserved1: 31;
        };
        uint32_t val;
    }reg_clk;
    union {
        struct {
            uint32_t date:      28;                    /*Version of this reg file*/
            uint32_t reserved28: 4;
        };
        uint32_t val;
    }version;
} mcpwm_dev_t;
extern mcpwm_dev_t MCPWM0;
extern mcpwm_dev_t MCPWM1;
#endif  /* _SOC_MCPWM_STRUCT_H__ */
